[
  {
    "brightSpot": "Dan: Jalapeno Cheddar Pop Corners chips, Jordan: [https://en.wikipedia.org/wiki/Steven_Universe_Future Steven Universe Future]",
    "episode_number": "410"
  },
  {
    "brightSpot": "Dan: [https://www.youtube.com/watch?v=Ol_D2iPR9so&list=PLw-vK1_d04zZCal3yMX_T23h5nDJ2toTk&ab_channel=JonnyGiger YouTube videos of Johnny Geiger recreating Rodney Mullen's skateboard tricks.], Jordan: Getting to spend time with his partner",
    "episode_number": "411"
  },
  {
    "brightSpot": "Dan: Listening to The 69 Boys album, 'The Wait Is Over', and finding it as ridiculous and fun as remembered. Jordan: Watching a blind speed race of Super Mario Maker levels on Awesome Games Done Quick",
    "episode_number": "412"
  },
  {
    "brightSpot": "Dan: Finding funny reviews of Klondike Boston Cream Donut bars online. Jordan: [https://en.wikipedia.org/wiki/It_Is_What_It_Is_(Thundercat_album) The new Thundercat album and its track 'Unrequited Love'.]",
    "episode_number": "413"
  },
  {
    "brightSpot": "Dan: [https://www.reddit.com/r/KnowledgeFight/ The Knowledge Fight subreddit], Jordan: Documentaries, especially hyper-specific ones like 'Fastball' or the Mike Tyson's Punch-Out record high score documentary by SummoningSalt.",
    "episode_number": "414"
  },
  {
    "brightSpot": "Dan: Discovering frozen hash brown patties can be bought at the store. Jordan: Discovering a book series by Anne McCaffrey: Dragon Song and Dragon Singer, about a girl pursuing music in a restrictive school.",
    "episode_number": "415"
  },
  {
    "brightSpot": "Dan: [https://en.wikipedia.org/wiki/WrestleMania_36#Part_1 Night one of Wrestlemania 36], Jordan: A generous gift from a Raptor Princess",
    "episode_number": "416"
  },
  {
    "brightSpot": "Dan: [https://en.wikipedia.org/wiki/WrestleMania_36#Part_2 Night two of WrestleMania 36], Jordan: Appearing on Opening Arguments podcast (#375)",
    "episode_number": "417"
  },
  {
    "brightSpot": "Dan: The FDA sending Alex a cease and desist letter about his various claims, especially concerning his silver products. Jordan: Taking cute pictures of his dogs",
    "episode_number": "418"
  },
  {
    "brightSpot": "Dan: Dan aspires to make lasagna , Jordan: Final Fantasy VII Remake",
    "episode_number": "419"
  },
  {
    "brightSpot": "Dan: Discovering weird foods: game-changing fudge batter M&M's and wild heat jerky. A rare 2:2. Jordan: Finished writing \"The Quiet Part Loud\".",
    "episode_number": "420"
  },
  {
    "brightSpot": "Dan: Finally numbered the podcasts, bummed that they missed being able to make a thing of 420. , Jordan: Taking long walks for sanity, and walking to record the podcast",
    "episode_number": "421"
  },
  {
    "brightSpot": "Dan: Listening to music, including Annie Lennox and the 1984 Dune soundtrack. Jordan: Appearing on the Truth Wanted podcast with Daniel Earls.",
    "episode_number": "422"
  },
  {
    "brightSpot": "Dan: Year of the Seltzer declared, starts with Aha Cherry Coffee Seltzer, Jordan: Corona Relief Done Quick video game fundraiser",
    "episode_number": "423"
  },
  {
    "brightSpot": "Dan: The Year of the Seltzer is aspirational for all. Dan will drink 500 different Seltzers by 4/20/21 and rate them, Jordan: Black cherry yogurt pairs well with Chocolate Lucky Charms if you're stir crazy",
    "episode_number": "424"
  },
  {
    "brightSpot": "Dan: Gifts from listeners including homemade masks and Matouks hot sauces, including Trinidad Scorpion sauce. Jordan: Rediscovering love of brisket and enjoying a meat coma.",
    "episode_number": "425"
  },
  {
    "brightSpot": "Dan: Andy Daly's new album, Four More Sweaters, and new podcast, Bonanas for Bonanza, both released over the weekend. Jordan: Personal growth; transforming from a \"giant shitbag\" into a slightly less giant one.",
    "episode_number": "426"
  },
  {
    "brightSpot": "Dan: Rearranged his apartment (moved bed to reduce noise), Jordan: Rearranged the living room",
    "episode_number": "427"
  },
  {
    "brightSpot": "Dan: Realizing chicken can be cooked in the oven. Jordan: Rediscovering the Redmask rendition of Dave Attell's Skanks for the Memories.",
    "episode_number": "428"
  },
  {
    "brightSpot": "Dan: Bray Wyatt's return to WWE. Jordan: New giant beanbag couch that is extremely comfortable for sleeping.",
    "episode_number": "733"
  },
  {
    "brightSpot": "Dan: Tools for shaving your back! Jordan: Jordan's wife getting her COVID booster and flu shot.",
    "episode_number": "748"
  },
  {
    "brightSpot": "Dan: Back in the saddle, recording in person again after a root canal. Knowledge Fight shows all sold out, with more tickets added in Boston. Jordan: Wife stood up to professional bullies in a spectacular and stirring fashion.",
    "episode_number": "900"
  },
  {
    "brightSpot": "Dan: The Boston show at the Middle East has sold out. Teared up listening to the Bosstones 'Live from the Middle East'. Jordan: Torrenting music to rebuild a lost collection and reclaim ownership. Listening to The Mars Volta album, 'De-loused in the Comatorium', and revisiting the drumming complexities.",
    "episode_number": "901"
  },
  {
    "brightSpot": "Dan: Creditors voted for liquidation in Alex's bankruptcy hearing. Could be an opportunity to acquire infowars.com. Jordan: The character Iroh in Avatar: The Last Airbender.",
    "episode_number": "902"
  },
  {
    "brightSpot": "Dan: Will be putting a new post on stackies.substack.com on March 1st. Jordan: The weather is nice outside. It's almost 60 degrees and bright and sunny.",
    "episode_number": "903"
  },
  {
    "brightSpot": "Dan: Going to get a little meal, Jordan: The release of Final Fantasy VII Rebirth",
    "episode_number": "904"
  },
  {
    "brightSpot": "Dan: That it's now freezing in Chicago, Jordan: Finally playing Final Fantasy VII Rebirth, [https://youtu.be/67sollJcWE4?si=CxRbzG0bW2Uq2b0a Being a guest on the On Brand podcast to analyze comedy]",
    "episode_number": "905"
  },
  {
    "brightSpot": "Dan: Got the Stackies Substack back up and running. Jordan: Went to a movie theater for the first time in five years, to see Dune",
    "episode_number": "906"
  },
  {
    "brightSpot": "Dan: Learning that Tanager George, the artist who created a very detailed drawing of Chicago from the air, is a fan of Knowledge Fight. Jordan: Fostering/dog-sitting two Westie puppies and a third dog, despite the challenges of caring for them, especially since one dog has liver problems and eats scrambled eggs every night.",
    "episode_number": "907"
  },
  {
    "brightSpot": "Dan: Trying the KFC Chizza (chicken pizza): it was fine, Jordan: Playing Final Fantasy VII Rebirth",
    "episode_number": "908"
  },
  {
    "brightSpot": "Dan: Not a bright spot, but a call-out: Unicorn-i-licious Haribos. Cotton candy flavor a definite pass. Jordan: Wife's mom picked up three of the puppies. The two remaining are less taxing.",
    "episode_number": "909"
  },
  {
    "brightSpot": "Dan: The fun of fantasy baseball. Watching season two of the British version of The Traitors. Jordan: Opening day of Major League Baseball happening in Korea, specifically watching Shohei Ohtani play for the Dodgers.",
    "episode_number": "910"
  },
  {
    "brightSpot": "Dan: Bespoke intro from DJ Danarchy for episode 911. Jordan: The return of The Amazing Race and Phil Kogan's job.",
    "episode_number": "911"
  },
  {
    "brightSpot": "Dan: Realizing wild meant 'grows wild' not 'cool'. Jordan: The Cure's new album is pretty good.",
    "episode_number": "978"
  },
  {
    "brightSpot": "Dan: Parents visiting from out of town, Jordan: A new shower is being installed at home",
    "episode_number": "979"
  },
  {
    "brightSpot": "Dan: Living in the calm between the election and Alex's auction. Jordan: The completion of the shower installation.",
    "episode_number": "980"
  },
  {
    "brightSpot": "Dan: Looking forward to documentary about Yacht Rock, Jordan: Thinking about Ewoks playing stormtrooper helmets like xylophones at the end of Return of the Jedi.",
    "episode_number": "981"
  },
  {
    "brightSpot": "Dan: Going on vacation, a much-needed break after a long period of work on the podcast. Jordan: The ATP Finals and the exciting new player Jannik Sinner.",
    "episode_number": "982"
  },
  {
    "brightSpot": "Dan: A Donkey Kong Country attraction is about to open in Japan, Jordan: [https://en.wikipedia.org/wiki/Sundial_(album) Sundial, by Noname]",
    "episode_number": "984"
  },
  {
    "brightSpot": "Dan: Being back in the studio after a trip to Europe. Secondary: buttons are coming back! Jordan: Great time with families over Thanksgiving",
    "episode_number": "985"
  },
  {
    "brightSpot": "Dan: New favorite snack: Squashies, Jordan: Kendrick Lamar's album Good Kid, M.A.A.D City",
    "episode_number": "986"
  },
  {
    "brightSpot": "Dan: Using the show as a reminder to finally buy a good winter coat. Jordan: Wife plotting for his happiness by getting him a chair after years of sitting on the floor.",
    "episode_number": "987"
  },
  {
    "brightSpot": "Dan: Realizing the word 'wonk' is 'know' spelled backwards in the mirror while brushing teeth and having a 'Usual Suspects' moment. Jordan: Guesting on the Cryptids Cocktail Party podcast about the Baba Yaga and on the Tyrants in Training podcast.",
    "episode_number": "988"
  },
  {
    "brightSpot": "Dan: Reese's Peanut Butter Bars, they're better than Cups! Jordan: Home-made Chex Mix",
    "episode_number": "989"
  },
  {
    "brightSpot": "Dan: A Jack-in-the-Box opened in Chicago (tragically bad tacos but somehow great), Jordan: Mailbag is overflowing: candy, socks, dog- and cat-stuff",
    "episode_number": "990"
  },
  {
    "brightSpot": "Dan: The new season of Tiny Dinos podcast, Jordan: Planning to head out to lunch with his cousin",
    "episode_number": "991"
  },
  {
    "brightSpot": "Dan: Putting 2024 in the past, looking forward to new year. Jordan: Had the best Christmas, and welcoming a new puppy, Sunny, to the family.",
    "episode_number": "992"
  },
  {
    "brightSpot": "Dan: The release of the first episode of Celine's Family Adventures. Features quokkas, which is a fun callback to when listeners from Australia would call in to correct the hosts on how to pronounce the word. Jordan: The surprisingly smooth transition of welcoming a new puppy, Sunny, into the home",
    "episode_number": "993"
  },
  {
    "brightSpot": "Dan: Buttons are coming out, some are glow-in-the-dark! Jordan: Finished second draft of manuscript, will stream it before starting third draft",
    "episode_number": "994"
  },
  {
    "brightSpot": "Dan: 2025 might be the Year of Eating Something Weird, starting with Cheekies (pretty good), Jordan: Cunk on Life, history parody now on Netflix",
    "episode_number": "995"
  },
  {
    "brightSpot": "Dan: The Challenge finale, and a friend getting a theremin at 18, Jordan: [https://preventcancer.org/events/awesome-games-done-quick/ Awesome Games Done Quick charity event for Prevent Cancer Foundation]",
    "episode_number": "996"
  },
  {
    "brightSpot": "Dan: Recently being on God Awful Movies podcast, and trying new Pringles flavors (Hot Ones Los Calientes), Jordan: Finishing Part One of new book The Institution and posting it on website",
    "episode_number": "997"
  },
  {
    "brightSpot": "Dan: Enjoying the new season of Traitors (US), particularly Carolyn (Wiger) from Survivor 44, Jordan: Enjoying The Traitors UK. The host is fine, but Alan Cummings is next level",
    "episode_number": "998"
  },
  {
    "brightSpot": "Dan: Hazy night-eating. Vague memories of eating banana-flavored circus peanut candy, Launching a GoFundMe for the Transgender Law Center: Nap-loving Celine's Call for Justice, Jordan: Tennis: Australian Open Week 2 and surprising success of American teenagers.",
    "episode_number": "999"
  },
  {
    "brightSpot": "Jordan: Puppy joining the rest of the pack",
    "episode_number": "1000"
  },
  {
    "brightSpot": "Dan: Getting the Knowledge Fight buttons out to listeners. Jordan: New Mogwai album sounds different, sparking nostalgic feelings.",
    "episode_number": "1001"
  },
  {
    "brightSpot": "Dan: Alex Horne Cameo, belated Bright Spot for #1000, Liza Treager's new Netflix special, Night Owl, Jordan: Playing Control",
    "episode_number": "1002"
  },
  {
    "brightSpot": "Dan: Enjoying The Traitors (US Season 3) too. (SPOILERS), Checking back in on eating weird foods, namely cheddar soaked in espresso martini. Found in the grocery store that shall not be named, where one-off oddities can be discovered. Jordan: Watching the latest episode of The Traitors (US Season 3) and enjoying the season's drama.",
    "episode_number": "1003"
  },
  {
    "brightSpot": "Dan: New season of The Challenge, The Challenge: All Stars, Jordan: New Weeknd album (Hurry Up Tomorrow)",
    "episode_number": "1004"
  },
  {
    "brightSpot": "Dan: Vacation planning and reflecting on Rockapella (Where in the World Is Carmen Sandiego?). Jordan: Watching The Penguin series, which reminds him of E L Doctorow's Billy Bathgate.",
    "episode_number": "1005"
  },
  {
    "brightSpot": "Dan: Checking back in with weird foods that are gonna be eaten in 2025 - tried two new products. Verdict: they sucked! Jordan: A new season of The Great Pottery Throw Down",
    "episode_number": "1006"
  },
  {
    "brightSpot": "Dan: The buttons are not all sent, but they are coming. 'Hith quality' envelopes have hit snags... Jordan: Fanny, Jordan's dog, is recovering from an abscess on her face. Jordan is grateful for his wife's mom and her vet.",
    "episode_number": "1007"
  },
  {
    "brightSpot": "Dan: The donuts Jordan brought Dan. Jordan: When we hear this, Dan will be on vacation and Jordan is excited for him.",
    "episode_number": "1008"
  },
  {
    "brightSpot": "Dan: Plant watch update: purple and white peppers flowering. Jordan: Valentine's Day dinner with wife: steak with Brussels sprouts and bacon.",
    "episode_number": "1009"
  },
  {
    "brightSpot": "Dan: Checking back in on weird foods. Tried peanut butter and jelly M&Ms, although it was underwhelming. Rice Krispie Treat flavored Peeps, which sucked, but were a great idea. , Jordan: Finally receiving a new chair after a previous order was canceled.",
    "episode_number": "1010"
  },
  {
    "brightSpot": "Dan: Watching Jamali Maddix's videos on Vice, finding them reminiscent of Louis Theroux's \"Weird Weekends\". Jordan: Hooked on new video game Warriors: Abyss, despite initially skepticism.",
    "episode_number": "1011"
  },
  {
    "brightSpot": "Dan: Weird foods: Jack's Pizza hot pockets. Jordan: Dehumidifiers are scary awesome!",
    "episode_number": "1012"
  },
  {
    "brightSpot": "Dan: Trying Post Malone's Oreo while listening to his music for the first time. Jordan: Having the dog groomed and fixed up. Potato donuts are great barter material.",
    "episode_number": "1013"
  },
  {
    "brightSpot": "Dan: Celine, the cat, laid on his chest, trying to stop him from reading. Jordan: Reading the graphic novel Monstress, featuring an original story and astonishing artwork.",
    "episode_number": "1014"
  },
  {
    "brightSpot": "Dan: Bright spot teaser: too big to reveal! Lesser bright spot: the 'new' Matrix movie (The Matrix Resurrections), Jordan: Indian Wells tennis tournament.",
    "episode_number": "1015"
  },
  {
    "brightSpot": "Dan: The pinky ring! Jordan: Getting his tattoo finished tomorrow.",
    "episode_number": "1016"
  },
  {
    "brightSpot": "Dan: Finding a 50-cent piece on the ground. The Arby's slogan, \"We have the meats\", and its hostile delivery. Jordan: Bon Iver's new album and the realization that the listener base is now just 'old people'.",
    "episode_number": "1017"
  },
  {
    "brightSpot": "Dan: Moving away from weird foods, 2025 is now the Year of the Pinky Ring. Jordan: Playing tennis for the first time this year, and winning a set of tennis against his cousin Ben for the first time ever",
    "episode_number": "1018"
  },
  {
    "brightSpot": "Dan: Pinky ring life: Dan gets a haircut wearing the ring. Playing the new Assassin's Creed game, which is gorgeous and so very woke. Jordan: Third wedding anniversary.",
    "episode_number": "1019"
  },
  {
    "brightSpot": "Dan: Baseball season is starting; might be going to a game with Jordan. Jordan: Opening day of baseball. Cubs are 0:2 before the season even starts.",
    "episode_number": "1020"
  },
  {
    "brightSpot": "Dan: Listening to The George Lucas Talk Show, particularly the episode with Seth Rogen, Jon Hamm, and Rich Sommer. Jordan: Playing tennis with his wife now that the weather is improving.",
    "episode_number": "1021"
  },
  {
    "brightSpot": "Dan: Liberation Day. Dan reclaims the phrase from Trump to describe the freedom of jumping forward in time. Jordan: The show Secret Millionaire (sic), actually Million Dollar Secret, hosted by Peter Serafinowicz. \"It's terrible, but it's great!\"",
    "episode_number": "1022"
  },
  {
    "brightSpot": "Dan: Pinky Ring Life: Emergency Room Visit, Jordan: [https://naomusic6.bandcamp.com/album/jupiter-3 New R&B album by NAO]",
    "episode_number": "1023"
  },
  {
    "brightSpot": "Dan: Didn't like the new PB&J Reese's Flavors, but respects the attempt. Jordan: His sister is about to have a baby!",
    "episode_number": "1024"
  },
  {
    "brightSpot": "Dan: KASSO, like Ninja Warrior for skateboards! Jordan: [https://www.goodreads.com/book/show/198902277-the-wedding-people The Wedding People, by Alison Espach]",
    "episode_number": "1025"
  },
  {
    "brightSpot": "Dan: New videogame, Blue Prince, has really caught his interest. Jordan: Finished Assassin's Creed, now free of the game.",
    "episode_number": "1026"
  },
  {
    "brightSpot": "Dan: [https://thepapermachete.org/ Pinky Ring Life: Went to the Paper Machete with a friend.], Jordan: [https://en.wikipedia.org/wiki/A_Study_of_Losses The album by Beirut.]",
    "episode_number": "1027"
  },
  {
    "brightSpot": "Dan: Packages of candy from fans! Also a comic book about The Cat, which Dan is getting framed. Jordan: Going to the first Cubs game of the year with his wife.",
    "episode_number": "1028"
  },
  {
    "brightSpot": "Dan: New pinkie ring from Jordan, complete with runes. Watched A Working Man with Angela Lampsbury, Jordan: Date night at the Cubs, who unexpectedly won - best night ever!",
    "episode_number": "1029"
  },
  {
    "brightSpot": "Dan: Looking forward to new season of (UK) Taskmaster, featuring Jason Mantzoukas, Jordan: Had a great shower!",
    "episode_number": "1030"
  },
  {
    "brightSpot": "Dan: Thinking about getting another tattoo: the Kikkoman soy sauce logo! Jordan: New (green) shoes!",
    "episode_number": "1031"
  },
  {
    "brightSpot": "Dan: Pinky Ring Life: brought a criminal veneer to a visit to a second-hand store, Jordan: Andor: the best Star Wars TV Series",
    "episode_number": "1032"
  },
  {
    "brightSpot": "Dan: New trimmer with nose hair attachment - no more plucking! Jordan: P T Anderson's Phantom Thread: plot spoilers!",
    "episode_number": "1033"
  },
  {
    "brightSpot": "Dan: Got some things framed, including a painting sent in by a listener, Jordan: Jordan's wife is feeling better, and both are enjoying MobLand",
    "episode_number": "1034"
  },
  {
    "brightSpot": "Dan: A strange letter from the condo association: who is throwing stuff off the balcony?! Jordan: Jordan's first 'old ass person' birthday",
    "episode_number": "1035"
  },
  {
    "brightSpot": "Dan: Thai peppers have finally fruited, Jordan: Family get-together, met his new niece",
    "episode_number": "1036"
  },
  {
    "brightSpot": "Dan: anti-Bright Spot: bought a risky mocha cheesecake; it was trash! Jordan: Expedition 33 video game",
    "episode_number": "1037"
  },
  {
    "brightSpot": "Dan: Got excited for Flipz 'Fried Chicken' flavoured pretzels, but they were 'Fried Chocolatey Sandwich', and not great, Jordan: Andor: reached the end, which runs straight into Rogue One",
    "episode_number": "1038"
  },
  {
    "brightSpot": "Dan: Saw Daniel Shar's show at Lincoln Lodge, with Jordan, Jordan: Enjoyed the show with Dan",
    "episode_number": "1039"
  },
  {
    "brightSpot": "Dan: A strange tortoise and hare themed ad for Phoenix University, Jordan: Beat the game Expedition 33, and has perfected the parry",
    "episode_number": "1040"
  },
  {
    "brightSpot": "Dan: The second season of Poker Face, Jordan: Roland-Garros (French Open); Spaniards will dominate the men's tournament forever",
    "episode_number": "1041"
  },
  {
    "brightSpot": "Dan: Pinky Ring Life: went to the dispensary; no obvious difference, Jordan: Resistance bands work great!",
    "episode_number": "1042"
  },
  {
    "brightSpot": "Dan: No bright spot. Dark spot: Reheated Jack-in-the-Box chicken sandwich was awful, Jordan: French Open turning out to be a great tournament ",
    "episode_number": "1043"
  },
  {
    "brightSpot": "Dan: Another dark spot: got a buzz cut, but with a goatee it looks a bit Alex Jones-ish, Jordan: World #361 and extremely French Loïs Boisson reaches semi-finals of French Open!",
    "episode_number": "1044"
  },
  {
    "brightSpot": "Dan: Another dark spot: solo ice-cream cake from Aldi, Jordan: Amazing French Open final!",
    "episode_number": "1045"
  },
  {
    "brightSpot": "Dan: Getting an eye exam and new glasses, Jordan: Being in France, Paris is incredible",
    "episode_number": "S010"
  },
  {
    "brightSpot": "Dan: Chocolate Graham Crackers, Jordan: [https://en.wikipedia.org/wiki/The_House_Is_Burning_(album) New album by Isaiah Rashad, his first in five years]",
    "episode_number": "S011"
  },
  {
    "brightSpot": "Dan: A trip to St. Louis to attend the wedding of a mutual friend and visit with old acquaintances. Jordan: Summer vacation means his partner isn't teaching / is free, [https://en.wikipedia.org/wiki/For_All_Mankind_(TV_series) Discovering the show \"For All Mankind\"]",
    "episode_number": "S012"
  },
  {
    "brightSpot": "Dan: Receiving a package full of chocolates from Germany, including Crispy Banana Ritter Sports, Making chili oil with shallots for the first time, Jordan: Anticipating a trip to Toronto with his wife, perhaps trying an escape room.",
    "episode_number": "S015"
  }
]