[
  {
    "brightSpot": "Dan: Jalapeno Cheddar Pop Corners chips, Jordan: [https://en.wikipedia.org/wiki/Steven_Universe_Future Steven Universe Future]",
    "episode_number": "410"
  },
  {
    "brightSpot": "Dan: [https://www.youtube.com/watch?v=Ol_D2iPR9so&list=PLw-vK1_d04zZCal3yMX_T23h5nDJ2toTk&ab_channel=JonnyGiger YouTube videos of Johnny Geiger recreating Rodney Mullen's skateboard tricks.], Jordan: Getting to spend time with his partner",
    "episode_number": "411"
  },
  {
    "brightSpot": "Dan: [https://en.wikipedia.org/wiki/WrestleMania_36#Part_2 Night two of WrestleMania 36], Jordan: Appearing on Opening Arguments podcast (#375)",
    "episode_number": "417"
  },
  {
    "brightSpot": "Dan: Bray Wyatt's return to WWE. Jordan: New giant beanbag couch that is extremely comfortable for sleeping.",
    "episode_number": "733"
  },
  {
    "brightSpot": "Dan: Tools for shaving your back! Jordan: Jordan's wife getting her COVID booster and flu shot.",
    "episode_number": "748"
  },
  {
    "brightSpot": "Jordan: Puppy joining the rest of the pack",
    "episode_number": "1000"
  },
  {
    "brightSpot": "Dan: Getting the Knowledge Fight buttons out to listeners. Jordan: New Mogwai album sounds different, sparking nostalgic feelings.",
    "episode_number": "1001"
  },
  {
    "brightSpot": "Dan: Alex Horne Cameo, belated Bright Spot for #1000, Liza Treager's new Netflix special, Night Owl, Jordan: Playing Control",
    "episode_number": "1002"
  },
  {
    "brightSpot": "Dan: Enjoying The Traitors (US Season 3) too. (SPOILERS), Checking back in on eating weird foods, namely cheddar soaked in espresso martini. Found in the grocery store that shall not be named, where one-off oddities can be discovered. Jordan: Watching the latest episode of The Traitors (US Season 3) and enjoying the season's drama.",
    "episode_number": "1003"
  },
  {
    "brightSpot": "Dan: New season of The Challenge, The Challenge: All Stars, Jordan: New Weeknd album (Hurry Up Tomorrow)",
    "episode_number": "1004"
  },
  {
    "brightSpot": "Dan: Vacation planning and reflecting on Rockapella (Where in the World Is Carmen Sandiego?). Jordan: Watching The Penguin series, which reminds him of E L Doctorow's Billy Bathgate.",
    "episode_number": "1005"
  },
  {
    "brightSpot": "Dan: Checking back in with weird foods that are gonna be eaten in 2025 - tried two new products. Verdict: they sucked! Jordan: A new season of The Great Pottery Throw Down",
    "episode_number": "1006"
  },
  {
    "brightSpot": "Dan: The buttons are not all sent, but they are coming. 'Hith quality' envelopes have hit snags... Jordan: Fanny, Jordan's dog, is recovering from an abscess on her face. Jordan is grateful for his wife's mom and her vet.",
    "episode_number": "1007"
  },
  {
    "brightSpot": "Dan: The donuts Jordan brought Dan. Jordan: When we hear this, Dan will be on vacation and Jordan is excited for him.",
    "episode_number": "1008"
  },
  {
    "brightSpot": "Dan: Plant watch update: purple and white peppers flowering. Jordan: Valentine's Day dinner with wife: steak with Brussels sprouts and bacon.",
    "episode_number": "1009"
  },
  {
    "brightSpot": "Dan: Checking back in on weird foods. Tried peanut butter and jelly M&Ms, although it was underwhelming. Rice Krispie Treat flavored Peeps, which sucked, but were a great idea. , Jordan: Finally receiving a new chair after a previous order was canceled.",
    "episode_number": "1010"
  },
  {
    "brightSpot": "Dan: Watching Jamali Maddix's videos on Vice, finding them reminiscent of Louis Theroux's \"Weird Weekends\". Jordan: Hooked on new video game Warriors: Abyss, despite initially skepticism.",
    "episode_number": "1011"
  },
  {
    "brightSpot": "Dan: Weird foods: Jack's Pizza hot pockets. Jordan: Dehumidifiers are scary awesome!",
    "episode_number": "1012"
  },
  {
    "brightSpot": "Dan: Trying Post Malone's Oreo while listening to his music for the first time. Jordan: Having the dog groomed and fixed up. Potato donuts are great barter material.",
    "episode_number": "1013"
  },
  {
    "brightSpot": "Dan: Celine, the cat, laid on his chest, trying to stop him from reading. Jordan: Reading the graphic novel Monstress, featuring an original story and astonishing artwork.",
    "episode_number": "1014"
  },
  {
    "brightSpot": "Dan: Bright spot teaser: too big to reveal! Lesser bright spot: the 'new' Matrix movie (The Matrix Resurrections), Jordan: Indian Wells tennis tournament.",
    "episode_number": "1015"
  },
  {
    "brightSpot": "Dan: The pinky ring! Jordan: Getting his tattoo finished tomorrow.",
    "episode_number": "1016"
  },
  {
    "brightSpot": "Dan: Finding a 50-cent piece on the ground. The Arby's slogan, \"We have the meats\", and its hostile delivery. Jordan: Bon Iver's new album and the realization that the listener base is now just 'old people'.",
    "episode_number": "1017"
  },
  {
    "brightSpot": "Dan: Moving away from weird foods, 2025 is now the Year of the Pinky Ring. Jordan: Playing tennis for the first time this year, and winning a set of tennis against his cousin Ben for the first time ever",
    "episode_number": "1018"
  },
  {
    "brightSpot": "Dan: Pinky ring life: Dan gets a haircut wearing the ring. Playing the new Assassin's Creed game, which is gorgeous and so very woke. Jordan: Third wedding anniversary.",
    "episode_number": "1019"
  },
  {
    "brightSpot": "Dan: Baseball season is starting; might be going to a game with Jordan. Jordan: Opening day of baseball. Cubs are 0:2 before the season even starts.",
    "episode_number": "1020"
  },
  {
    "brightSpot": "Dan: Listening to The George Lucas Talk Show, particularly the episode with Seth Rogen, Jon Hamm, and Rich Sommer. Jordan: Playing tennis with his wife now that the weather is improving.",
    "episode_number": "1021"
  },
  {
    "brightSpot": "Dan: Liberation Day. Dan reclaims the phrase from Trump to describe the freedom of jumping forward in time. Jordan: The show Secret Millionaire (sic), actually Million Dollar Secret, hosted by Peter Serafinowicz. \"It's terrible, but it's great!\"",
    "episode_number": "1022"
  },
  {
    "brightSpot": "Dan: Pinky Ring Life: Emergency Room Visit, Jordan: [https://naomusic6.bandcamp.com/album/jupiter-3 New R&B album by NAO]",
    "episode_number": "1023"
  }
]